#include <stdio.h>

/**
1 * 1 = 1
1 * 2 = 2        2 * 2 = 4
1 * 3 = 3        2 * 3 = 6        3 * 3 = 9
………………………………
*/
int main()
{
    /**
        用i表示行
        用j表示1到第i行

        a * b
        a = 1....i
        b = i

        i = 1, 1 <= 9, 条件为1，则进入循环体
            j = 1, 1 <= 1,条件为1，进入循环体
                输出1 * 1 = 1，再执行j++
            j = 2, 2 <= 1,条件为0，结束循环
            输出换行，执行i++
        i = 2, 2 <= 9, 条件为1，进入循环体
            j = 1, 1 <= 2, 条件为1，进入循环体
                输出1 * 2 = 2，执行j++
            j = 2, 2 <= 2, 条件为1，进入循环体
                输出2 * 2 = 4，执行j++
            j = 3, 3 <= 2, 条件为0，结束循环
            输出换行，执行i++
        i = 3, 3 <= 9

    */
    for (int i = 1; i <=9; i++)
    {
        for (int j = 1; j <= i; j++) {
            printf("%d * %d = %d        ", j, i, i * j);
        }
        printf("\n");
    }
    return 0;
}
